SOAP-service/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getFilmRequest>
         <gs:name>Tree House</gs:name>
      </gs:getFilmRequest>
   </soapenv:Body>
</soapenv:Envelope>
